//СР3(3) Составьте программу на c++, которая определяет получит ли Иванов стипендию. Если он сдаст вовремя экзамены по русскому языку, математике и информатике.
#include <math.h>
#include <iostream>
using namespace std;

int main() {
    char rus, math, inf;

    cout << "\nВведите 'y', если экзамен сдан вовремя, или 'n', если нет.";

    cout << "\nРусский язык: ";
    cin >> rus;

    cout << "\nМатематика: ";
    cin >> math;

    cout << "\nИнформатика: ";
    cin >> inf;

    // Проверяем, сданы ли все экзамены вовремя 
    if (rus == 'y' && math == 'y' && inf == 'y') {
        cout << "\nИванов получит стипендию!";
    } else {
        cout << "\nИванов не получит стипендию.";
    }

    return 0;
}