//СР4(3) У гусей и кроликов вместе 64 лапы. Напишите программу для c++ для того чтобы узнать сколько может быть кроликов и гусей?
#include <math.h>
#include <iostream>
using namespace std;

int main() {
    int legs = 64;

    cout << "Возможные комбинации количества кроликов и гусей:\n";
    cout << "Кролики (r) | Гуси (g)\n";
    cout << "-----------------------\n";

    for (int r = 0; r <= legs / 4; ++r) {
        int g = (legs - 4 * r) / 2;
        if (g >= 0 && (legs - 4 * r) % 2 == 0) {
            cout << r << "     " << g << "\n";
        }
    }

    return 0;
}